[
    {"title": "Селектор",
    "text": "Селектор в CSS используется для указания элементов, к которым будут применяться определенные стили. Селектор может быть идентификатором, классом, тегом или комбинацией этих элементов."},
    {"title": "Свойство",
    "text": "Свойство в CSS определяет конкретный стиль, который будет применяться к выбранным элементам. Например, свойство 'color' определяет цвет текста, а свойство 'font-size' задает размер шрифта."},
    {"title": "Значение",
    "text": "Значение в CSS указывает конкретное значение для определенного свойства. Например, для свойства 'background-color' значение может быть 'red', '#FF0000' или 'rgb(255, 0, 0)'."},
    {"title": "Класс",
    "text": "Класс в CSS представляет собой именованную группу элементов, к которым можно применить определенные стили. Классы позволяют повторно использовать стили на разных элементах."},
    {"title": "Идентификатор",
    "text": " Идентификатор в CSS представляет собой уникальный идентификатор элемента на веб-странице. Он указывается с помощью символа '#' перед именем и позволяет точечно применять стили к этому элементу."},
    {"title": "Псевдокласс",
    "text": "   Псевдокласс в CSS используется для выбора элементов в определенном состоянии или событии. Например, псевдокласс ':hover' применяется к элементу при наведении на него курсора."},
    {"title": "Псевдоэлемент",
    "text": "Псевдоэлемент в CSS позволяет добавить стили к определенной части элемента. Например, псевдоэлемент '::before' добавляет содержимое перед элементом, а псевдоэлемент '::after' добавляет содержимое после элемента."},
    {"title": "Блочный элемент",
    "text": "Блочный элемент в CSS занимает всю доступную горизонтальную ширину и начинает новую строку на веб-странице. Примеры блочных элементов включают <div>, <p> и <h1>-<h6>."},
    {"title": "Строчный элемент",
    "text": "Строчный элемент в CSS не начинает новую строку и занимает только необходимую ширину. Примеры строчных элементов включают <span>, <a> и <strong>."},
    {"title": "Внутренние и внешние отступы",
    "text": "Внутренний отступ (padding) в CSS определяет расстояние между границей элемента и его содержимым. Внешний отступ (margin) задает расстояние между элементами на веб-странице."}
]